
namespace OLX_parser
{
    partial class Form1
    {
        /// <summary>
        /// Required designer variable.
        /// </summary>
        private System.ComponentModel.IContainer components = null;

        /// <summary>
        /// Clean up any resources being used.
        /// </summary>
        /// <param name="disposing">true if managed resources should be disposed; otherwise, false.</param>
        protected override void Dispose(bool disposing)
        {
            if (disposing && (components != null))
            {
                components.Dispose();
            }
            base.Dispose(disposing);
        }

        #region Windows Form Designer generated code

        /// <summary>
        /// Required method for Designer support - do not modify
        /// the contents of this method with the code editor.
        /// </summary>
        private void InitializeComponent()
        {
            this.components = new System.ComponentModel.Container();
            this.requestBox = new System.Windows.Forms.TextBox();
            this.searchButton = new System.Windows.Forms.Button();
            this.dataGridView1 = new System.Windows.Forms.DataGridView();
            this.Name = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.Description = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.Link = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.Price = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.Id = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.Published = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.PictureLink = new System.Windows.Forms.DataGridViewTextBoxColumn();
            this.label1 = new System.Windows.Forms.Label();
            this.label2 = new System.Windows.Forms.Label();
            this.stopButton = new System.Windows.Forms.Button();
            this.clearButton = new System.Windows.Forms.Button();
            this.saveButton = new System.Windows.Forms.Button();
            this.saveFileDialog1 = new System.Windows.Forms.SaveFileDialog();
            this.regionsComboBox = new System.Windows.Forms.ComboBox();
            this.toolTip1 = new System.Windows.Forms.ToolTip(this.components);
            this.RubricComboBox = new System.Windows.Forms.ComboBox();
            this.SubrubricComboBox = new System.Windows.Forms.ComboBox();
            this.label3 = new System.Windows.Forms.Label();
            this.label4 = new System.Windows.Forms.Label();
            ((System.ComponentModel.ISupportInitialize)(this.dataGridView1)).BeginInit();
            this.SuspendLayout();
            // 
            // requestBox
            // 
            this.requestBox.Location = new System.Drawing.Point(12, 108);
            this.requestBox.Name = "requestBox";
            this.requestBox.Size = new System.Drawing.Size(228, 20);
            this.requestBox.TabIndex = 0;
            this.requestBox.Text = "шапка";
            // 
            // searchButton
            // 
            this.searchButton.Location = new System.Drawing.Point(12, 20);
            this.searchButton.Name = "searchButton";
            this.searchButton.Size = new System.Drawing.Size(228, 26);
            this.searchButton.TabIndex = 2;
            this.searchButton.Text = "Старт";
            this.searchButton.UseVisualStyleBackColor = true;
            this.searchButton.Click += new System.EventHandler(this.searchButton_Click);
            // 
            // dataGridView1
            // 
            this.dataGridView1.ColumnHeadersHeightSizeMode = System.Windows.Forms.DataGridViewColumnHeadersHeightSizeMode.AutoSize;
            this.dataGridView1.Columns.AddRange(new System.Windows.Forms.DataGridViewColumn[] {
            this.Name,
            this.Description,
            this.Link,
            this.Price,
            this.Id,
            this.Published,
            this.PictureLink});
            this.dataGridView1.Location = new System.Drawing.Point(246, 20);
            this.dataGridView1.Name = "dataGridView1";
            this.dataGridView1.Size = new System.Drawing.Size(745, 500);
            this.dataGridView1.TabIndex = 3;
            // 
            // Name
            // 
            this.Name.HeaderText = "Название";
            this.Name.Name = "Name";
            // 
            // Description
            // 
            this.Description.HeaderText = "Описание";
            this.Description.Name = "Description";
            // 
            // Link
            // 
            this.Link.HeaderText = "Ссылка";
            this.Link.Name = "Link";
            // 
            // Price
            // 
            this.Price.HeaderText = "Цена";
            this.Price.Name = "Price";
            // 
            // Id
            // 
            this.Id.HeaderText = "Id";
            this.Id.Name = "Id";
            // 
            // Published
            // 
            this.Published.HeaderText = "Опубликовано";
            this.Published.Name = "Published";
            // 
            // PictureLink
            // 
            this.PictureLink.HeaderText = "Картинка";
            this.PictureLink.Name = "PictureLink";
            // 
            // label1
            // 
            this.label1.AutoSize = true;
            this.label1.Location = new System.Drawing.Point(9, 92);
            this.label1.Name = "label1";
            this.label1.Size = new System.Drawing.Size(44, 13);
            this.label1.TabIndex = 4;
            this.label1.Text = "Запрос";
            // 
            // label2
            // 
            this.label2.AutoSize = true;
            this.label2.Location = new System.Drawing.Point(9, 131);
            this.label2.Name = "label2";
            this.label2.Size = new System.Drawing.Size(43, 13);
            this.label2.TabIndex = 5;
            this.label2.Text = "Регион";
            // 
            // stopButton
            // 
            this.stopButton.Location = new System.Drawing.Point(12, 53);
            this.stopButton.Name = "stopButton";
            this.stopButton.Size = new System.Drawing.Size(228, 23);
            this.stopButton.TabIndex = 6;
            this.stopButton.Text = "Стоп";
            this.stopButton.UseVisualStyleBackColor = true;
            this.stopButton.Click += new System.EventHandler(this.stopButton_Click);
            // 
            // clearButton
            // 
            this.clearButton.Location = new System.Drawing.Point(12, 271);
            this.clearButton.Name = "clearButton";
            this.clearButton.Size = new System.Drawing.Size(228, 23);
            this.clearButton.TabIndex = 7;
            this.clearButton.Text = "Очистить список";
            this.clearButton.UseVisualStyleBackColor = true;
            this.clearButton.Click += new System.EventHandler(this.clearButton_Click);
            // 
            // saveButton
            // 
            this.saveButton.Location = new System.Drawing.Point(12, 300);
            this.saveButton.Name = "saveButton";
            this.saveButton.Size = new System.Drawing.Size(228, 23);
            this.saveButton.TabIndex = 8;
            this.saveButton.Text = "Сохранить в файл";
            this.saveButton.UseVisualStyleBackColor = true;
            this.saveButton.Click += new System.EventHandler(this.saveButton_Click);
            // 
            // saveFileDialog1
            // 
            this.saveFileDialog1.Filter = "xlsx files (*.xlsx)|*.xlsx|All files (*.*)|*.*";
            // 
            // regionsComboBox
            // 
            this.regionsComboBox.FormattingEnabled = true;
            this.regionsComboBox.Items.AddRange(new object[] {
            "Вся Украина",
            "Бар, Винницкая область",
            "Бершадь, Винницкая область",
            "Винница, Винницкая область",
            "Гайсин, Винницкая область",
            "Гнивань, Винницкая область",
            "Городок, Винницкая область",
            "Жмеринка, Винницкая область",
            "Ильинцы, Винницкая область",
            "Казатин, Винницкая область",
            "Калиновка, Винницкая область",
            "Крыжополь, Винницкая область",
            "Ладыжин, Винницкая область",
            "Липовец, Винницкая область",
            "Могилев-Подольский, Винницкая область",
            "Немиров, Винницкая область",
            "Песочин, Винницкая область",
            "Погребище, Винницкая область",
            "Стрижавка, Винницкая область",
            "Тульчин, Винницкая область",
            "Хмельник, Винницкая область",
            "Чечельник, Винницкая область",
            "Шаргород, Винницкая область",
            "Ямполь, Винницкая область",
            "Берестечко, Волынская область",
            "Броды, Волынская область",
            "Владимир-Волынский, Волынская область",
            "Горохов, Волынская область",
            "Иваничи, Волынская область",
            "Камень-Каширский, Волынская область",
            "Киверцы, Волынская область",
            "Ковель, Волынская область",
            "Кременец, Волынская область",
            "Луцк, Волынская область",
            "Любешов, Волынская область",
            "Любомль, Волынская область",
            "Маневичи, Волынская область",
            "Нововолынск, Волынская область",
            "Ратно, Волынская область",
            "Рожище, Волынская область",
            "Старая Выжевка, Волынская область",
            "Турийск, Волынская область",
            "Устилуг, Волынская область",
            "Цумань, Волынская область",
            "Шацк, Волынская область",
            "Апостолово, Днепропетровская область",
            "Верхнеднепровск, Днепропетровская область",
            "Вольногорск, Днепропетровская область",
            "Днепр, Днепропетровская область",
            "Желтые Воды, Днепропетровская область",
            "Каменское, Днепропетровская область",
            "Кривой Рог, Днепропетровская область",
            "Марганец, Днепропетровская область",
            "Никополь, Днепропетровская область",
            "Новомосковск, Днепропетровская область",
            "Орджоникидзе, Днепропетровская область",
            "Павлоград, Днепропетровская область",
            "Перещепино, Днепропетровская область",
            "Першотравенск, Днепропетровская область",
            "Подгородное, Днепропетровская область",
            "Пятихатки, Днепропетровская область",
            "Синельниково, Днепропетровская область",
            "Терновка, Днепропетровская область",
            "Чаплинка, Днепропетровская область",
            "Авдеевка, Донецкая область",
            "Александровка, Донецкая область",
            "Амвросиевка, Донецкая область",
            "Бахмут, Донецкая область",
            "Волноваха, Донецкая область",
            "Горловка, Донецкая область",
            "Дебальцево, Донецкая область",
            "Дзержинск, Донецкая область",
            "Димитров, Донецкая область",
            "Доброполье, Донецкая область",
            "Докучаевск, Донецкая область",
            "Донецк, Донецкая область",
            "Дружковка, Донецкая область",
            "Енакиево, Донецкая область",
            "Ждановка, Донецкая область",
            "Зугрэс, Донецкая область",
            "Кировское, Донецкая область",
            "Константиновка, Донецкая область",
            "Краматорск, Донецкая область",
            "Красноармейск, Донецкая область",
            "Красный Лиман, Донецкая область",
            "Майорск, Донецкая область",
            "Макеевка, Донецкая область",
            "Мариуполь, Донецкая область",
            "Марьинка, Донецкая область",
            "Новоазовск, Донецкая область",
            "Новогродовка, Донецкая область",
            "Селидово, Донецкая область",
            "Славянск, Донецкая область",
            "Снежное, Донецкая область",
            "Соледар, Донецкая область",
            "Старобешево, Донецкая область",
            "Торез, Донецкая область",
            "УгледарХарцызск, Донецкая область",
            "Шахтерск, Донецкая область",
            "Ясиноватая, Донецкая область",
            "Андрушевка, Житомирская область",
            "Барановка, Житомирская область",
            "Бердичев, Житомирская область",
            "Володарск-Волынский, Житомирская область",
            "Емильчино, Житомирская область",
            "Житомир, Житомирская область",
            "Иршанск, Житомирская область",
            "Коростень, Житомирская область",
            "Коростышев, Житомирская область",
            "Малин, Житомирская область",
            "Новоград-Волынский, Житомирская область",
            "Овруч, Житомирская область",
            "Олевск, Житомирская область",
            "Попельня, Житомирская область",
            "Радомышль, Житомирская область",
            "Романов, Житомирская область",
            "Черняхов, Житомирская область",
            "Берегово, Закарпатская область",
            "Буштына, Закарпатская область",
            "Великий Бычков, Закарпатская область",
            "Виноградов, Закарпатская область",
            "Вышково, Закарпатская область",
            "Дубовое, Закарпатская область",
            "Иршава, Закарпатская область",
            "Королево, Закарпатская область",
            "Межгорье, Закарпатская область",
            "Мукачево, Закарпатская область",
            "Перечин, Закарпатская область",
            "Рахов, Закарпатская область",
            "Свалява, Закарпатская область",
            "Солотвина, Закарпатская область",
            "Тячев, Закарпатская область",
            "Ужгород, Закарпатская область",
            "Хуст, Закарпатская область",
            "Чоп, Закарпатская область",
            "Акимовка, Запорожская область",
            "Беляевка, Запорожская область",
            "Бердянск, Запорожская область",
            "Васильевка, Запорожская область",
            "Веселое, Запорожская область",
            "Вольнянск, Запорожская область",
            "Гуляйполе, Запорожская область",
            "Днепрорудное, Запорожская область",
            "Запорожье, Запорожская область",
            "Каменка-Днепровская, Запорожская область",
            "Куйбышево, Запорожская область",
            "Кушугум, Запорожская область",
            "Мелитополь, Запорожская область",
            "Михайловка, Запорожская область",
            "Молочанск, Запорожская область",
            "Орехов, Запорожская область",
            "Пологи, Запорожская область",
            "Приморск, Запорожская область",
            "Розовка, Запорожская область",
            "Токмак, Запорожская область",
            "Энергодар, Запорожская область",
            "Богородчаны, Ивано-франковская область",
            "Болехов, Ивано-франковская область",
            "Бурштын, Ивано-франковская область",
            "Галич, Ивано-франковская область",
            "Городенка, Ивано-франковская область",
            "Делятин, Ивано-франковская область",
            "Долина, Ивано-франковская область",
            "Ивано-Франковск, Ивано-франковская область",
            "Калуш, Ивано-франковская область",
            "Коломыя, Ивано-франковская область",
            "Косов, Ивано-франковская область",
            "Ланчин, Ивано-франковская область",
            "Надворная, Ивано-франковская область",
            "Перегинское, Ивано-франковская область",
            "Рогатин, Ивано-франковская область",
            "Снятын, Ивано-франковская область",
            "Тлумач, Ивано-франковская область",
            "Тысменица, Ивано-франковская область",
            "Яремче, Ивано-франковская область",
            "Барышевка, Киевская область",
            "Белая Церковь, Киевская область",
            "Березань, Киевская область",
            "Богуслав, Киевская область",
            "Борисполь, Киевская область",
            "Бородянка, Киевская область",
            "Боярка, Киевская область",
            "Бровары, Киевская область",
            "Буча, Киевская область",
            "Васильков, Киевская область",
            "Вишневое, Киевская область",
            "Володарка, Киевская область",
            "Вышгород, Киевская область",
            "Глеваха, Киевская область",
            "Гостомель, Киевская область",
            "Иванков, Киевская область",
            "Ирпень, Киевская область",
            "Кагарлык, Киевская область",
            "Киев, Киевская область",
            "Коцюбинское, Киевская область",
            "Макаров, Киевская область",
            "Мироновка, Киевская область",
            "Обухов, Киевская область",
            "Переяслав-Хмельницкий",
            "Припять, Киевская область",
            "Ржищев, Киевская область",
            "Рокитное, Киевская область",
            "Сквира, Киевская область",
            "Славутич, Киевская область",
            "Тараща, Киевская область",
            "Тетиев, Киевская область",
            "Узин, Киевская область",
            "Украинка, Киевская область",
            "Фастов, Киевская область",
            "Чернобыль, Киевская область",
            "Яготин, Киевская область",
            "Александрия, Кировоградская область",
            "Бобринец, Кировоградская область",
            "Власовка, Кировоградская область",
            "Гайворон, Кировоградская область",
            "Долинская, Кировоградская область",
            "Знаменка, Кировоградская область",
            "Кропивницкий, Кировоградская область",
            "Малая Виска, Кировоградская область",
            "Новая Прага, Кировоградская область",
            "Новоархангельск, Кировоградская область",
            "Новое, Кировоградская область",
            "Новомиргород, Кировоградская область",
            "Новоукраинка, Кировоградская область",
            "Первомайск, Кировоградская область",
            "Петрово, Кировоградская область",
            "Помошная, Кировоградская область",
            "Светловодск, Кировоградская область",
            "Смолино, Кировоградская область",
            "Алупка, Крым(АРК)",
            "Алушта, Крым(АРК)",
            "Армянск, Крым(АРК)",
            "Бахчисарай, Крым(АРК)",
            "Белогорск, Крым(АРК)",
            "Береговое, Крым(АРК)",
            "Джанкой, Крым(АРК)",
            "Евпатория, Крым(АРК)",
            "Знаменка, Крым(АРК)",
            "Инкерман, Крым(АРК)",
            "Керчь, Крым(АРК)",
            "Красногвардейское, Крым(АРК)",
            "Красноперекопск, Крым(АРК)",
            "Раздольное, Крым(АРК)",
            "Саки, Крым(АРК)",
            "Севастополь, Крым(АРК)",
            "Симферополь, Крым(АРК)",
            "Старый Крым, Крым(АРК)",
            "Судак, Крым(АРК)",
            "Феодосия, Крым(АРК)",
            "Черноморское, Крым(АРК)",
            "Щёлкино, Крым(АРК)",
            "Ялта, Крым(АРК)",
            "Александровск, Луганская область",
            "Алмазная, Луганская область",
            "Алчевск, Луганская область",
            "Антрацит, Луганская область",
            "Артемовск, Луганская область",
            "Брянка, Луганская область",
            "Вахрушево, Луганская область",
            "Горное, Луганская область",
            "Горское, Луганская область",
            "Зимогорье, Луганская область",
            "Золотое, Луганская область",
            "Зоринск, Луганская область",
            "Ирмино, Луганская область",
            "Кировск, Луганская область",
            "Краснодон, Луганская область",
            "Краснопартизанск, Луганская область",
            "Красный Луч, Луганская область",
            "Кременная, Луганская область",
            "Лисичанск, Луганская область",
            "Луганск, Луганская область",
            "Лутугино, Луганская область",
            "Миусинск, Луганская область",
            "Молодогвардейск, Луганская область",
            "Новодружеск, Луганская область",
            "Новопсков, Луганская область",
            "Первомайск, Луганская область",
            "Перевальск, Луганская область",
            "Петровское, Луганская область",
            "Попасная, Луганская область",
            "Приволье, Луганская область",
            "Ровеньки, Луганская область",
            "Рубежное, Луганская область",
            "Сватово, Луганская область",
            "Свердловск, Луганская область",
            "Северодонецк, Луганская область",
            "Станица Луганская, Луганская область",
            "Старобельск, Луганская область",
            "Стаханов, Луганская область",
            "Суходольск, Луганская область",
            "Счастье, Луганская область",
            "Червонопартизанск, Луганская область",
            "Белз, Львовская область",
            "Бобрка, Львовская область",
            "Борислав, Львовская область",
            "Буск, Львовская область",
            "Великие Мосты, Львовская область",
            "Винники, Львовская область",
            "Глиняны, Львовская область",
            "Городок, Львовская область",
            "Добромиль, Львовская область",
            "Дрогобыч, Львовская область",
            "Дубляны, Львовская область",
            "Жидачев, Львовская область",
            "Жолква, Львовская область",
            "Золочев, Львовская область",
            "Каменка-Бугская, Львовская область",
            "Львов, Львовская область",
            "Мостиска, Львовская область",
            "Николаев, Львовская область",
            "Новояворовск, Львовская область",
            "Новый Роздол, Львовская область",
            "Перемышляны, Львовская область",
            "Пустомыты, Львовская область",
            "Рава-Русская, Львовская область",
            "Радехов, Львовская область",
            "Рудки, Львовская область",
            "Самбор, Львовская область",
            "Сколе, Львовская область",
            "Сокаль, Львовская область",
            "Сосновка, Львовская область",
            "Старый Самбор, Львовская область",
            "Стебник, Львовская область",
            "Стрый, Львовская область",
            "Трускавец, Львовская область",
            "Угнев, Львовская область",
            "Хыров, Львовская область",
            "Червоноград, Львовская область",
            "Яворов, Львовская область",
            "Александровка, Николаевская область",
            "Арбузинка, Николаевская область",
            "Баштанка, Николаевская область",
            "Березнеговатое, Николаевская область",
            "Братское, Николаевская область",
            "Веселиново, Николаевская область",
            "Вознеснеск, Николаевская область",
            "Врадиевка, Николаевская область",
            "Доманевка, Николаевская область",
            "Еланец, Николаевская область",
            "Казанка, Николаевская область",
            "Кривое Озеро, Николаевская область",
            "Николаев, Николаевская область",
            "Новая Одесса, Николаевская область",
            "Новый Буг, Николаевская область",
            "Очаков, Николаевская область",
            "Первомайск, Николаевская область",
            "Снигиревка, Николаевская область",
            "Южноукраинск, Николаевская область",
            "Ананьев, Одесская область",
            "Арциз, Одесская область",
            "Балта, Одесская область",
            "Белгород-Днестровский, Одесская область",
            "Беляевка, Одесская область",
            "Березовка, Одесская область",
            "Болград, Одесская область",
            "Великодолинское, Одесская область",
            "Измаил, Одесская область",
            "Килия, Одесская область",
            "Кодыма, Одесская область",
            "Любашевка, Одесская область",
            "Овидиополь, Одесская область",
            "Одесса, Одесская область",
            "Подольск, Одесская область",
            "Раздельная, Одесская область",
            "Рени, Одесская область",
            "Татарбунары, Одесская область",
            "Теплодар, Одесская область",
            "Черноморск, Одесская область",
            "Ширяево, Одесская область",
            "Южное, Одесская область",
            "Гадяч, Полтавская область",
            "Глобино, Полтавская область",
            "Горишные Плавни, Полтавская область",
            "Градижск, Полтавская область",
            "Гребенка, Полтавская область",
            "Дергачи, Полтавская область",
            "Диканька, Полтавская область",
            "Зенькова, Полтавская область",
            "Карловка, Полтавская область",
            "Кобеляки, Полтавская область",
            "Котельва, Полтавская область",
            "Кременчуг, Полтавская область",
            "Лохвица, Полтавская область",
            "Лубны, Полтавская область",
            "Миргород, Полтавская область",
            "Новые Санжары, Полтавская область",
            "Пирятин, Полтавская область",
            "Полтава, Полтавская область",
            "Решетиловка, Полтавская область",
            "Хорол, Полтавская область",
            "Червонозаводское, Полтавская область",
            "Чутово, Полтавская область",
            "Березне, Ровенская область",
            "Вараш, Ровенская область",
            "Владимирец, Ровенская область",
            "Дубно, Ровенская область",
            "Дубровица, Ровенская область",
            "Заречное, Ровенская область",
            "Здолбунов, Ровенская область",
            "Квасилов, Ровенская область",
            "Клевань, Ровенская область",
            "Корец, Ровенская область",
            "Костополь, Ровенская область",
            "Млинов, Ровенская область",
            "Острог, Ровенская область",
            "Радивилов, Ровенская область",
            "Ровно, Ровенская область",
            "Рокитное, Ровенская область",
            "Сарны, Ровенская область",
            "Ахтырка, Сумская область",
            "Белополье, Сумская область",
            "Бурынь, Сумская область",
            "Ворожба, Сумская область",
            "Воронеж, Сумская область",
            "Глухов, Сумская область",
            "Дружба, Сумская область",
            "Конотоп, Сумская область",
            "Краснополье, Сумская область",
            "Кролевец, Сумская область",
            "Лебедин, Сумская область",
            "Путивль, Сумская область",
            "Ромны, Сумская область",
            "Свесса, Сумская область",
            "Середина-Буда, Сумская область",
            "Сумы, Сумская область",
            "Тростянец, Сумская область",
            "Шостка, Сумская область",
            "Бережаны, Тернопольская область",
            "Борщев, Тернопольская область",
            "Бучач, Тернопольская область",
            "Великая Березовица, Тернопольская область",
            "Гусятин, Тернопольская область",
            "Залещики, Тернопольская область",
            "Збараж, Тернопольская область",
            "Зборов, Тернопольская область",
            "Козова, Тернопольская область",
            "Копычинцы, Тернопольская область",
            "Лановцы, Тернопольская область",
            "Монастыриска, Тернопольская область",
            "Подволочиск, Тернопольская область",
            "Подгайцы, Тернопольская область",
            "Почаев, Тернопольская область",
            "Скалат, Тернопольская область",
            "Теребовля, Тернопольская область",
            "Тернополь, Тернопольская область",
            "Хоростков, Тернопольская область",
            "Чертков, Тернопольская область",
            "Шумск, Тернопольская область",
            "Балаклея, Харьковская область",
            "Барвенково, Харьковская область",
            "Богодухов, Харьковская область",
            "Валки, Харьковская область",
            "Великий Бурлук, Харьковская область",
            "Волчанск, Харьковская область",
            "Высокий, Харьковская область",
            "Дергачи, Харьковская область",
            "Змиев, Харьковская область",
            "Изюм, Харьковская область",
            "Комсомольское, Харьковская область",
            "Купянск, Харьковская область",
            "Лозовая, Харьковская область",
            "Люботин, Харьковская область",
            "Мерефа, Харьковская область",
            "Мирноград, Харьковская область",
            "Новая Водолага, Харьковская область",
            "Первомайск, Харьковская область",
            "Солоницевка, Харьковская область",
            "Харьков, Харьковская область",
            "Чугуев, Харьковская область",
            "Антоновка, Херсонская область",
            "Белозерка, Херсонская область",
            "Берислав, Херсонская область",
            "Великая Александровка, Херсонская область",
            "Великая Лепетиха, Херсонская область",
            "Геническ, Херсонская область",
            "Голая Пристань, Херсонская область",
            "Каланчак, Херсонская область",
            "Камышаны, Херсонская область",
            "Каховка, Херсонская область",
            "Новая Каховка, Херсонская область",
            "Новая Маячка, Херсонская область",
            "Новоалексеевка, Херсонская область",
            "Новотроицкое, Херсонская область",
            "Олешкы, Херсонская область",
            "Скадовск, Херсонская область",
            "Таврийск, Херсонская область",
            "Херсон, Херсонская область",
            "Виньковцы, Хмельницкая область",
            "Волочиск, Хмельницкая область",
            "Деражня, Хмельницкая область",
            "Дунаевцы, Хмельницкая область",
            "Изяслав, Хмельницкая область",
            "Каменец-Подольский, Хмельницкая область",
            "Красилов, Хмельницкая область",
            "Летичев, Хмельницкая область",
            "Нетешин, Хмельницкая область",
            "Полонное, Хмельницкая область",
            "Понинка, Хмельницкая область",
            "Славута, Хмельницкая область",
            "Староконстантинов, Хмельницкая область",
            "Теофиполь, Хмельницкая область",
            "Хмельницкий, Хмельницкая область",
            "Шепетовка, Хмельницкая область",
            "Ватутино, Черкасская область",
            "Городище, Черкасская область",
            "Драбов, Черкасская область",
            "Жашков, Черкасская область",
            "Звенигородка, Черкасская область",
            "Золотоноша, Черкасская область",
            "Каменка, Черкасская область",
            "Канев, Черкасская область",
            "Корсунь-Шевченковский, Черкасская область",
            "Лысянка, Черкасская область",
            "Маньковка, Черкасская область",
            "Монастырище, Черкасская область",
            "Смела, Черкасская область",
            "Тальное, Черкасская область",
            "Умань, Черкасская область",
            "Христиновка, Черкасская область",
            "Черкассы, Черкасская область",
            "Чернобай, Черкасская область",
            "Чигирин, Черкасская область",
            "Шпола, Черкасская область",
            "Бахмач, Черниговская область",
            "Бобровица, Черниговская область",
            "Борзна, Черниговская область",
            "Городня, Черниговская область",
            "Десна, Черниговская область",
            "Ичня, Черниговская область",
            "Козелец, Черниговская область",
            "Корюковка, Черниговская область",
            "Мена, Черниговская область",
            "Нежин, Черниговская область",
            "Новгород-Северский, Черниговская область",
            "Носовка, Черниговская область",
            "Прилуки, Черниговская область",
            "Седнев, Черниговская область",
            "Семеновка, Черниговская область",
            "Чернигов, Черниговская область",
            "Щорс, Черниговская область",
            "Берегомет, Черновицкая область",
            "Вашковцы, Черновицкая область",
            "Вижница, Черновицкая область",
            "Герца, Черновицкая область",
            "Глыбокая, Черновицкая область",
            "Заставна, Черновицкая область",
            "Кельменцы, Черновицкая область",
            "Кицмань, Черновицкая область",
            "Красноильск, Черновицкая область",
            "Новоднестровск, Черновицкая область",
            "Новоселица, Черновицкая область",
            "Путила, Черновицкая область",
            "Сокиряны, Черновицкая область",
            "Сторожинец, Черновицкая область",
            "Хотин, Черновицкая область",
            "Черновцы, Черновицкая область"});
            this.regionsComboBox.Location = new System.Drawing.Point(12, 147);
            this.regionsComboBox.Name = "regionsComboBox";
            this.regionsComboBox.Size = new System.Drawing.Size(228, 21);
            this.regionsComboBox.TabIndex = 9;
            this.regionsComboBox.Text = "Вся Украина";
            // 
            // RubricComboBox
            // 
            this.RubricComboBox.FormattingEnabled = true;
            this.RubricComboBox.Items.AddRange(new object[] {
            "Все рубрики",
            "Детский мир",
            "Недвижимость",
            "Авто",
            "Запчасти для транспорта",
            "Работа",
            "Животные",
            "Дом и сад",
            "Электроника",
            "Бизнес и услуги",
            "Мода и стиль",
            "Хобби, отдых и спорт",
            "Отдам даром",
            "Обмен"});
            this.RubricComboBox.Location = new System.Drawing.Point(12, 188);
            this.RubricComboBox.Name = "RubricComboBox";
            this.RubricComboBox.Size = new System.Drawing.Size(228, 21);
            this.RubricComboBox.TabIndex = 10;
            this.RubricComboBox.Text = "Все рубрики";
            this.RubricComboBox.SelectedIndexChanged += new System.EventHandler(this.changedRubric);
            // 
            // SubrubricComboBox
            // 
            this.SubrubricComboBox.FormattingEnabled = true;
            this.SubrubricComboBox.Location = new System.Drawing.Point(12, 233);
            this.SubrubricComboBox.Name = "SubrubricComboBox";
            this.SubrubricComboBox.Size = new System.Drawing.Size(228, 21);
            this.SubrubricComboBox.TabIndex = 11;
            // 
            // label3
            // 
            this.label3.AutoSize = true;
            this.label3.Location = new System.Drawing.Point(9, 172);
            this.label3.Name = "label3";
            this.label3.Size = new System.Drawing.Size(49, 13);
            this.label3.TabIndex = 12;
            this.label3.Text = "Рубрика";
            // 
            // label4
            // 
            this.label4.AutoSize = true;
            this.label4.Location = new System.Drawing.Point(12, 214);
            this.label4.Name = "label4";
            this.label4.Size = new System.Drawing.Size(68, 13);
            this.label4.TabIndex = 13;
            this.label4.Text = "Подрубрика";
            // 
            // Form1
            // 
            this.AutoScaleDimensions = new System.Drawing.SizeF(6F, 13F);
            this.AutoScaleMode = System.Windows.Forms.AutoScaleMode.Font;
            this.ClientSize = new System.Drawing.Size(997, 524);
            this.Controls.Add(this.label4);
            this.Controls.Add(this.label3);
            this.Controls.Add(this.SubrubricComboBox);
            this.Controls.Add(this.RubricComboBox);
            this.Controls.Add(this.regionsComboBox);
            this.Controls.Add(this.saveButton);
            this.Controls.Add(this.clearButton);
            this.Controls.Add(this.stopButton);
            this.Controls.Add(this.label2);
            this.Controls.Add(this.label1);
            this.Controls.Add(this.dataGridView1);
            this.Controls.Add(this.searchButton);
            this.Controls.Add(this.requestBox);
            this.FormBorderStyle = System.Windows.Forms.FormBorderStyle.FixedSingle;
            //this.Name = "Form1";
            this.Text = "OLX парсер";
            ((System.ComponentModel.ISupportInitialize)(this.dataGridView1)).EndInit();
            this.ResumeLayout(false);
            this.PerformLayout();

        }

        #endregion

        private System.Windows.Forms.TextBox requestBox;
        private System.Windows.Forms.Button searchButton;
        private System.Windows.Forms.DataGridView dataGridView1;
        private System.Windows.Forms.DataGridViewTextBoxColumn Name;
        private System.Windows.Forms.Label label1;
        private System.Windows.Forms.Label label2;
        private System.Windows.Forms.DataGridViewTextBoxColumn Description;
        private System.Windows.Forms.DataGridViewTextBoxColumn Link;
        private System.Windows.Forms.DataGridViewTextBoxColumn Price;
        private System.Windows.Forms.DataGridViewTextBoxColumn Id;
        private System.Windows.Forms.DataGridViewTextBoxColumn Published;
        private System.Windows.Forms.DataGridViewTextBoxColumn PictureLink;
        private System.Windows.Forms.Button stopButton;
        private System.Windows.Forms.Button clearButton;
        private System.Windows.Forms.Button saveButton;
        private System.Windows.Forms.SaveFileDialog saveFileDialog1;
        private System.Windows.Forms.ComboBox regionsComboBox;
        private System.Windows.Forms.ToolTip toolTip1;
        private System.Windows.Forms.ComboBox RubricComboBox;
        private System.Windows.Forms.ComboBox SubrubricComboBox;
        private System.Windows.Forms.Label label3;
        private System.Windows.Forms.Label label4;
    }
}

